# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [6]:
c.execute("""SELECT city from offices;""").fetchall()

[('San Francisco',),
 ('Boston',),
 ('NYC',),
 ('Paris',),
 ('Tokyo',),
 ('Sydney',),
 ('London',)]

In [8]:
#Your code here
c.execute("""SELECT firstName, lastName FROM employees  JOIN offices USING(officeCode) WHERE city = 'Boston' """)
c.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [14]:
#Your code here
#using having caluse, find out if hame of office has no people by lastName ='None'
c.execute("""SELECT city, firstName, lastName FROM offices LEFT JOIN employees USING(officeCode) GROUP BY city  having firstName = 'None'""")
c.fetchall()

[]

In [17]:
c.execute("""SELECT city,
                    COUNT(*) as numb_employees
                    FROM offices
                    LEFT JOIN employees
                    USING(officeCode)
                    GROUP BY 1""")
df = pd.DataFrame(c.fetchall(), columns =[x[0] for x in c.description])
df

            city  numb_employees
0         Boston               2
1         London               2
2            NYC               2
3          Paris               5
4  San Francisco               6
5         Sydney               4
6          Tokyo               2

## Write 3 Questions of your own and answer them

1. Names of five customers who spent the most money

In [35]:
c.execute("""SELECT * FROM payments""")
df = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
df.head()

  customerNumber checkNumber paymentDate    amount
0            103    HQ336336  2004-10-19   6066.78
1            103    JM555205  2003-06-05  14571.44
2            103    OM314933  2004-12-18   1676.14
3            112    BO864823  2004-12-17  14191.12
4            112     HQ55022  2003-06-06  32641.98

In [30]:
c.execute("""SELECT * FROM customers""")
df = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
df.columns

Index(['customerNumber', 'customerName', 'contactLastName', 'contactFirstName',
       'phone', 'addressLine1', 'addressLine2', 'city', 'state', 'postalCode',
       'country', 'salesRepEmployeeNumber', 'creditLimit'],
      dtype='object')

In [39]:
# Your code here
c.execute("""SELECT customerName, SUM(amount) as total 
            FROM customers JOIN payments USING(customerNumber) 
            GROUP BY customerNumber ORDER BY total DESC LIMIT 5; """)
df = pd.DataFrame(c.fetchall(), columns =[x[0] for x in c.description])
df.head()

                   customerName      total
0        Euro+ Shopping Channel  715738.98
1  Mini Gifts Distributors Ltd.  584188.24
2    Australian Collectors, Co.  180585.07
3            Muscle Machine Inc  177913.95
4       Dragon Souveniers, Ltd.  156251.03

2. Average payment amount that customers made

In [41]:
# Your code here
c.execute("""SELECT AVG(amount) FROM payments""")
df = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
df.head()

    AVG(amount)
0  32431.645531

In [44]:
# Your code here
c.execute("""SELECT customerName, AVG(amount) as ave_amount
            FROM customers JOIN payments 
            USING(customerNumber) 
            GROUP BY customerName ORDER BY ave_amount DESC""")
df = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
df.head()

                   customerName    ave_amount
0  Collectable Mini Designs Co.  80375.240000
1      Corporate Gift Ideas Co.  66170.390000
2  Mini Gifts Distributors Ltd.  64909.804444
3     The Sharp Gifts Warehouse  59551.380000
4        Euro+ Shopping Channel  55056.844615

<img src='images/Database-Schema.png' width="600">

## Level Up: Display the names of each product each employee has sold

In [51]:
# Your code here
c.execute("""select firstName, lastName, productName 
            from employees e 
            join customers c 
            on(e.employeeNumber = c.salesRepEmployeeNumber) 
            join orders o using(customerNumber)
            join orderdetails od using(orderNumber)
            join products using(productCode)
            ;""")
df = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
df.head()
df.head()

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [52]:
#Your code here
df.groupby(['firstName','lastName']).count()

                     productName
firstName lastName
Andy      Fixter             185
Barry     Jones              220
Foon Yue  Tseng              142
George    Vanauf             211
Gerard    Hernandez          396
Julie     Firrelli           124
Larry     Bott               236
Leslie    Jennings           331
          Thompson           114
Loui      Bondur             177
Mami      Nishi              137
Martin    Gerard             114
Pamela    Castillo           272
Peter     Marsh              185
Steve     Patterson          152

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!